In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame({'key1':['a','a','b','a','a'],
                 'key2':['one','two','one','two','one'],
                  'data1':np.random.randn(5),
                 'data2':np.random.randn(5)})

In [3]:
df

      data1     data2 key1 key2
0 -1.253670  0.980322    a  one
1  0.488184 -0.198725    a  two
2 -0.744464 -0.826780    b  one
3  0.715500  1.597440    a  two
4  1.081919  1.195356    a  one

In [4]:
grouped=df['data1'].groupby(df['key1'])

In [5]:
grouped

In [6]:
grouped.mean()

key1
a    0.257983
b   -0.744464
Name: data1, dtype: float64

In [7]:
means=df['data1'].groupby([df['key1'],df['key2']]).mean()

In [8]:
means

key1  key2
a     one    -0.085875
      two     0.601842
b     one    -0.744464
Name: data1, dtype: float64

In [9]:
means.unstack()

key2       one       two
key1
a    -0.085875  0.601842
b    -0.744464       NaN

In [15]:
states=np.array(['Ohio','California','California','Ohio','Ohio'])

In [16]:
years=np.array([2005,2005,2006,2005,2006])

In [18]:
df['data1'].groupby([states,years]).mean()

California  2005    0.488184
            2006   -0.744464
Ohio        2005   -0.269085
            2006    1.081919
Name: data1, dtype: float64

In [19]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.257983  0.893598
b    -0.744464 -0.826780

In [20]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -0.085875  1.087839
     two   0.601842  0.699357
b    one  -0.744464 -0.826780

In [21]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     2
b     one     1
dtype: int64